#include <iostream>
#include <cmath>

// На вход вашей программе в стандартном вводе даны действительные коэффициенты A, B и C уравнения
// Ax² + Bx + C = 0. Выведите все его различные действительные корни в любом порядке.
// Гарантируется, что хотя бы один из коэффициентов не равен нулю.

int main(){
  double a,b,c;
  std::cin >> a >> b >> c;
  double d = sqrt((b * b) - (4 * a * c));
  if(a == 0.0){
    if( b != 0.0) { // уравнение имеет вид bx + с = 0
      std::cout << -(c / b);
    }
    // уравнение не имеет корней в случае если a и b равны 0
  }
  else if (d == 0.0) {
    std::cout << - b / (2 * a);
  }
  else if (d > 0.0) {
    double x1, x2;
    x1 = (- b - d) / (2 * a);
    x2 = (- b + d) / (2 * a);
    std::cout << x1 << " " << x2;
  }
  return 0;
}

