#include <iostream>
#include <cstdint>

using std::cin;
using std::cout;

// Вычислите суммарную массу имеющих форму прямоугольного параллелепипеда бетонных
// блоков одинаковой плотности, но разного размера.
//
// Указание
// Считайте, что размеры блоков измеряются в сантиметрах, плотность — в граммах
// на кубический сантиметр, а итоговая масса — в граммах. Таким образом, массу
// блока можно вычислять как простое произведение плотности на объём.
//
// Формат ввода
// В первой строке вводятся два целых положительных числа: количество блоков
// N и плотность каждого блока R. Каждая из следующих N строк содержит три целых
// положительных числа W, H, D — размеры очередного блока.
//
// Гарантируется, что:
//
// - количество блоков N не превосходит 10^5;
// - плотность блоков R не превосходит 100;
// - размеры блоков W, H, D не превосходят 10^4.

int main() {
  uint32_t n, W,H,D;
  uint16_t r;
  cin >> n >> r;
  uint64_t sum = 0;
  for(size_t i = 0; i < n; i++){
    cin >> W >> H >> D;
    sum += static_cast<uint64_t>(W) * H * D;
  }
  sum *= r;
  cout << sum;
}

