// Напишите возвращающую bool шаблонную функцию compare, которая принимает две константные/
// ссылки на объекты одного типа и указатель на константный метод этого типа без параметров,
// который в свою очередь возвращает значение какого-то второго типа. Функция должна
// сравнивать объекты по значениям, которые для них вернёт соответствующий метод
// и возвращать true, если значение для первого объекта оказалось меньше, чем для второго.

template<typename InstanceType, typename ReturnType>
bool compare(const InstanceType& a, const InstanceType& b, ReturnType (InstanceType::*mptr)() const)
{
    return (a.*mptr)() < (b.*mptr)();
}
